       01  REG-CLIENTE-ARQ.
           05 REG-ID         PIC 9(05).
           05 REG-NOME       PIC X(30).
           05 REG-TELEFONE   PIC X(18).
           05 REG-EMAIL      PIC X(30).
           