       01 REG-CLIENTE.
           05 CLI-ID         PIC 9(05).
           05 CLI-NOME       PIC X(30).
           05 TELEFONE       PIC X(18).
           05 EMAIL          PIC X(30).
           05 STATUS-RETORNO PIC X(02).
             