       01  DB-CLIENTE.
           05  HV-CLI-ID    PIC 9(9).
           05  HV-CLI-NOME  PIC X(30).
           05  HV-CLI-SALDO PIC 9(9).
           
