      01  DB-TRANSACAO.
           05  TRX-CLI-ID   PIC S9(9).
           05  HV-TRX-ID    PIC S9(9). 
           05  HV-TRX-TIPO  PIC X(1).
           05  HV-TRX-VALOR PIC S9(9).
           