       01  DFHCOMMAREA.
           05  COMM-FUNCAO      PIC X(01).
           05  COMM-CODCLI      PIC 9(06).
           05  COMM-NOME        PIC X(30).
           05  COMM-TELEFONE    PIC X(15).
           05  COMM-CIDADE      PIC X(20).
           05  COMM-RETORNO     PIC 9(02).
