       01  REG-CLIENTE.
           05 CODCLI        PIC 9(06).
           05 NOME          PIC X(30).
           05 TELEFONE      PIC X(15).
           05 CIDADE        PIC X(20).
