//HERC01C  JOB (KICKS),CLASS=A,MSGCLASS=H
//JOBPROC  DD DSN=HERC01.KICKSSYS.V1R5M0.PROCLIB,DISP=SHR
//         EXEC K2KCOBCL
//COPY.SYSUT1 DD DSN=HERC01.PRIVLIB.SOURCE(CLIPMG),DISP=SHR
//LKED.SYSIN  DD *
 INCLUDE SKIKLOAD(KIKCOBGL)
 ENTRY CLIPMG
 NAME CLIPMG(R)
/*
