//HERC01C  JOB (VSAM),CLASS=A,MSGCLASS=H
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DEFINE CLUSTER ( -
         NAME(HERC01.VSAM.CLIENTES) -
         VOLUMES(TSO002) -
         UNIQUE -
         INDEXED -
         RECORDSIZE(71 71) -
         KEYS(6 0) -
         TRACKS(1 1) -
         ) -
  DATA (NAME(HERC01.VSAM.CLIENTES.DATA)) -
  INDEX (NAME(HERC01.VSAM.CLIENTES.INDEX))
/*
