//HERC01M  JOB (KICKS),CLASS=A,MSGCLASS=H
//JOBPROC  DD DSN=HERC01.KICKSSYS.V1R5M0.PROCLIB,DISP=SHR
//         EXEC KIKMAPS,MAPNAME=MAPSET1
//COPY.SYSUT1 DD DSN=HERC01.PRIVLIB.SOURCE(MAPSET),DISP=SHR
