//HERC01XX  JOB (COMPILA),CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),REGION=8M   00000110
//STEP1       EXEC COBUCL,PARM.COB='DYNAM,LIB,SIZE=MAX,BUF=1024K'       00000209
//COB.SYSIN    DD DSN=HERC01.CONTBANC.SOURCE(CONTREAD),DISP=SHR         00000300
//COB.SYSLIB   DD DSN=HERC01.CONTBANC.COPYLIB,DISP=SHR                  00000400
//LKED.SYSLMOD DD DSN=HERC01.CONTBANC.LOADLIB(CONTREAD),DISP=SHR        00000500
//STEP2       EXEC COBUCL,PARM.COB='DYNAM,LIB,SIZE=MAX,BUF=1024K'       00000609
//COB.SYSIN    DD DSN=HERC01.CONTBANC.SOURCE(CONTDATA),DISP=SHR         00000700
//COB.SYSLIB   DD DSN=HERC01.CONTBANC.COPYLIB,DISP=SHR                  00000800
//LKED.SYSLMOD DD DSN=HERC01.CONTBANC.LOADLIB(CONTDATA),DISP=SHR        00000900
//STEP3       EXEC COBUCL,PARM.COB='DYNAM,LIB,SIZE=MAX,BUF=1024K'       00001009
//COB.SYSIN    DD DSN=HERC01.CONTBANC.SOURCE(CONTCALC),DISP=SHR         00001100
//COB.SYSLIB   DD DSN=HERC01.CONTBANC.COPYLIB,DISP=SHR                  00001200
//LKED.SYSLMOD DD DSN=HERC01.CONTBANC.LOADLIB(CONTCALC),DISP=SHR        00001300
//STEP4       EXEC COBUCL,PARM.COB='DYNAM,LIB,SIZE=MAX,BUF=1024K'       00001409
//COB.SYSIN    DD DSN=HERC01.CONTBANC.SOURCE(CONTINFO),DISP=SHR         00001500
//COB.SYSLIB   DD DSN=HERC01.CONTBANC.COPYLIB,DISP=SHR                  00001600
//LKED.SYSLMOD DD DSN=HERC01.CONTBANC.LOADLIB(CONTINFO),DISP=SHR        00001700
//STEP5       EXEC COBUCL,PARM.COB='DYNAM,LIB,SIZE=MAX,BUF=1024K'       00001809
//COB.SYSIN    DD DSN=HERC01.CONTBANC.SOURCE(CONTMAIN),DISP=SHR         00001901
//COB.SYSLIB   DD DSN=HERC01.CONTBANC.COPYLIB,DISP=SHR                  00002001
//LKED.SYSLMOD DD DSN=HERC01.CONTBANC.LOADLIB(CONTMAIN),DISP=SHR        00002101
//LKED.MYLIB   DD DSN=HERC01.CONTBANC.LOADLIB,DISP=SHR                  00002213
//LKED.SYSIN   DD *                                                     00002313
 INCLUDE MYLIB(CONTREAD,CONTDATA,CONTCALC,CONTINFO)                     00002413
