//HERC01XX JOB (GDG),CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1)
//GDGSTEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DEFINE GDG (NAME(HERC01.TRANBANC.CLIUP.GDG) LIMIT(5) SCRATCH)
  DEFINE GDG (NAME(HERC01.TRANBANC.ERROS.GDG) LIMIT(5) SCRATCH)
/*
//GDGSTEP2 EXEC PGM=IEFBR14
//GDGMOD   DD DSN=HERC01.TRANBANC.ARQ,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(TRK,0),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//
