//HERC01XX JOB (MODELO),CLASS=C,MSGCLASS=X,MSGLEVEL=(1,1),REGION=8M
//STEP1    EXEC PGM=IEFBR14
//SYSPRINT DD SYSOUT=*
//MODEL    DD DSN=HERC01.TRANBANC.MODEL,
//            DISP=(NEW,CATLG),
//            UNIT=SYSDA,
//            VOL=SER=TSO003,
//            SPACE=(TRK,0),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//
