//HERC01XX  JOB (COMPILA),CLASS=C,MSGCLASS=X,MSGLEVEL=(1,1),REGION=8M
//STEP1       EXEC COBUCL,PARM.COB='DYNAM,LIB,SIZE=MAX,BUF=1024K'
//COB.SYSIN    DD DSN=HERC01.TRANBANC.SOURCE(TRANREAD),DISP=SHR
//COB.SYSLIB   DD DSN=HERC01.TRANBANC.COPYLIB,DISP=SHR
//LKED.SYSLMOD DD DSN=HERC01.TRANBANC.LOADLIB(TRANREAD),DISP=SHR
//STEP2       EXEC COBUCL,PARM.COB='DYNAM,LIB,SIZE=MAX,BUF=1024K'
//COB.SYSIN    DD DSN=HERC01.TRANBANC.SOURCE(TRANVALD),DISP=SHR
//COB.SYSLIB   DD DSN=HERC01.TRANBANC.COPYLIB,DISP=SHR
//LKED.SYSLMOD DD DSN=HERC01.TRANBANC.LOADLIB(TRANVALD),DISP=SHR
//STEP3       EXEC COBUCL,PARM.COB='DYNAM,LIB,SIZE=MAX,BUF=1024K'
//COB.SYSIN    DD DSN=HERC01.TRANBANC.SOURCE(TRANRULE),DISP=SHR
//COB.SYSLIB   DD DSN=HERC01.TRANBANC.COPYLIB,DISP=SHR
//LKED.SYSLMOD DD DSN=HERC01.TRANBANC.LOADLIB(TRANRULE),DISP=SHR
//STEP4       EXEC COBUCL,PARM.COB='DYNAM,LIB,SIZE=MAX,BUF=1024K'
//COB.SYSIN    DD DSN=HERC01.TRANBANC.SOURCE(TRANOUT),DISP=SHR
//COB.SYSLIB   DD DSN=HERC01.TRANBANC.COPYLIB,DISP=SHR
//LKED.SYSLMOD DD DSN=HERC01.TRANBANC.LOADLIB(TRANOUT),DISP=SHR
//STEP5       EXEC COBUCL,PARM.COB='DYNAM,LIB,SIZE=MAX,BUF=1024K'
//COB.SYSIN    DD DSN=HERC01.TRANBANC.SOURCE(TRANMAIN),DISP=SHR
//COB.SYSLIB   DD DSN=HERC01.TRANBANC.COPYLIB,DISP=SHR
//LKED.SYSLMOD DD DSN=HERC01.TRANBANC.LOADLIB(TRANMAIN),DISP=SHR
//LKED.MYLIB   DD DSN=HERC01.TRANBANC.LOADLIB,DISP=SHR
//LKED.SYSIN   DD *
 INCLUDE MYLIB(TRANREAD,TRANVALD,TRANRULE,TRANOUT)
