//HERC01XX JOB (TRANEXEC),CLASS=C,MSGCLASS=X,MSGLEVEL=(1,1),REGION=8M
//STEP1    EXEC PGM=SORT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SORTLIB  DD DSN=SYS1.SORTLIB,DISP=SHR
//SORTIN   DD DSN=HERC01.TRANBANC.CLIENTES,DISP=SHR
//SORTOUT  DD DSN=&&CLITEMP,DISP=(NEW,PASS),
//            SPACE=(TRK,(1,1)),
//            UNIT=SYSDA,
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//SORTWK01 DD UNIT=SYSDA,SPACE=(CYL,2)
//SORTWK02 DD UNIT=SYSDA,SPACE=(CYL,2)
//SORTWK03 DD UNIT=SYSDA,SPACE=(CYL,2)
//SYSIN    DD *
 SORT FIELDS=(1,5,CH,A)
/*
//STEP2    EXEC PGM=SORT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SORTLIB  DD DSN=SYS1.SORTLIB,DISP=SHR
//SORTIN   DD DSN=HERC01.TRANBANC.TRANSAC,DISP=SHR
//SORTOUT  DD DSN=&&TRXTEMP,DISP=(NEW,PASS),
//            SPACE=(TRK,(1,1)),
//            UNIT=SYSDA,
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//SORTWK01 DD UNIT=SYSDA,SPACE=(CYL,2)
//SORTWK02 DD UNIT=SYSDA,SPACE=(CYL,2)
//SORTWK03 DD UNIT=SYSDA,SPACE=(CYL,2)
//SYSIN    DD *
 SORT FIELDS=(1,5,CH,A)
/*
//STEP3    EXEC PGM=TRANMAIN
//STEPLIB  DD DSN=HERC01.TRANBANC.LOADLIB,DISP=SHR
//MOLDE    DD DSN=HERC01.TRANBANC.ARQ,DISP=SHR
//CLIENTES DD DSN=&&CLITEMP,DISP=(SHR,DELETE)
//TRANSAC  DD DSN=&&TRXTEMP,DISP=(SHR,DELETE)
//CLIUP    DD DSN=HERC01.TRANBANC.CLIUP.GDG(+1),
//            DISP=(NEW,CATLG),UNIT=SYSDA,SPACE=(TRK,(10,5),RLSE),
//            DCB=(SYS1.MACLIB,RECFM=FB,LRECL=80,BLKSIZE=800)
//ERROS    DD DSN=HERC01.TRANBANC.ERROS.GDG(+1),
//            DISP=(NEW,CATLG),UNIT=SYSDA,SPACE=(TRK,(10,5),RLSE),
//            DCB=(SYS1.MACLIB,RECFM=FB,LRECL=80,BLKSIZE=800)
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//
