       01  REG-CLIENTE.
           05 CLI-ID        PIC 9(05).
           05 CLI-NOME      PIC X(30).
           05 CLI-SALDO     PIC 9(09).
           05 FILLER        PIC X(36) VALUE SPACES.
