//HERC01XX JOB (SISBANC),CLASS=C,MSGCLASS=X,MSGLEVEL=(1,1),REGION=8M
//STEP1    EXEC PGM=SORT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SORTLIB  DD DSN=SYS1.SORTLIB,DISP=SHR
//SORTIN   DD DSN=HERC01.CLIENTES,DISP=SHR
//SORTOUT  DD DSN=&&CLITEMP,DISP=(NEW,PASS),
//            SPACE=(TRK,(1,1)),
//            UNIT=SYSDA,
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//SORTWK01 DD UNIT=SYSDA,SPACE=(CYL,2)
//SORTWK02 DD UNIT=SYSDA,SPACE=(CYL,2)
//SORTWK03 DD UNIT=SYSDA,SPACE=(CYL,2)
//SYSIN    DD *
 SORT FIELDS=(1,5,CH,A)
/*
//STEP2    EXEC PGM=SORT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SORTLIB  DD DSN=SYS1.SORTLIB,DISP=SHR
//SORTIN   DD DSN=HERC01.TRANSAC,DISP=SHR
//SORTOUT  DD DSN=&&TRXTEMP,DISP=(NEW,PASS),
//            SPACE=(TRK,(1,1)),
//            UNIT=SYSDA,
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//SORTWK01 DD UNIT=SYSDA,SPACE=(CYL,2)
//SORTWK02 DD UNIT=SYSDA,SPACE=(CYL,2)
//SORTWK03 DD UNIT=SYSDA,SPACE=(CYL,2)
//SYSIN    DD *
 SORT FIELDS=(1,5,CH,A)
/*
//STEP3    EXEC PGM=SISBANC
//STEPLIB  DD DSN=HERC01.SISBANC.LOADLIB,DISP=SHR
//CLIENTES DD DSN=&&CLITEMP,DISP=(OLD,DELETE)
//TRANSAC  DD DSN=&&TRXTEMP,DISP=(OLD,DELETE)
//CLIUP    DD DSN=HERC01.SISBANC.LOG.GDG(+1),
//            DISP=(NEW,CATLG),UNIT=SYSDA,SPACE=(TRK,(10,5),RLSE),
//            DCB=HERC01.SISBANC.MODEL
//ERROS    DD DSN=HERC01.SISBANC.ERROS.GDG(+1),
//            DISP=(NEW,CATLG),UNIT=SYSDA,SPACE=(TRK,(10,5),RLSE),
//            DCB=HERC01.SISBANC.MODEL
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//
